Repository: 84000/data-translation-memory
Catalog: toh182-v2.tmx
Source language: bo
Languages: en

source: འཕགས་པ་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།
en: The Noble Great Vehicle Sūtra The Perfection of Generosity

source: སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ། །
en: Homage to all buddhas and bodhisattvas!

source: འདི་སྐད་བདག་གིས་ཐོས་པ་དུས་གཅིག་ན།
en: Thus did I hear at one time.

source: བཅོམ་ལྡན་འདས་ཉིད་ཀྱི་རྩ་ལག་དང་། ཡུལ་གྱི་མི་རྣམས་ལ་ཕན་གདགས་པའི་ཕྱིར་སེར་སྐྱའི་གནས་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོ་ན་རྒྱལ་པོ་ཟས་གཙང་གི་ཀུན་དགའ་ར་བ་ཤིང་སཱ་ལ་དང་། ཏ་ལ་དང་། ཏ་མ་ལ་དང་། དོང་ཀའི་ཤིང་དང་། རྒྱ་ཤུག་དང་། སྟར་ག་ཤིང་དང་། འབྲ་གོ་དང་། ཤི་བ་ཊ་དང་། ཀ་དམ་པ་དང་། ཨ་མྲ་དང་། ཉོ་ཏི་དང་། སྐྱུ་རུ་རའི་ཤིང་དང་། བིལ་བ་དང་། བལ་པོ་སེའུ་དང་། ཀ་པིད་ཐ་དང་། ཆུ་ཤིང་དང་། ནྱ་གྲོ་དྷ་དང་། ཨུ་དུམ་བ་ར་དང་། བ་རུ་རའི་ཤིང་དང་། ཨ་ཤྭ་ད་ཐ་དང་། བར་ཤི་ཀ་དང་། སྣ་མ་དང་། དྷ་ནུ་སྐ་རི་དང་། ཨ་ཏི་མུག་ཏ་དང་། ཙམ་པ་ཀ་དང་། མྱ་ངན་འཚང་དང་། ཏ་ར་ནི་དང་། སྐྱ་སྣར་དང་། ཤི་རི་ཤ་དང་། ཨ་རྫུ་ན་དང་། ཤིང་ལྗོན་པ་བརྒྱ་སྟོང་དུ་མས་བརྒྱན་པ།
en: The Blessed One, in order to benefit his kinsmen and the local people, was residing in the parks of King Śuddhodhana in the city of Kapilavastu, parks adorned with many hundreds of thousands of trees of different types, such as sāla, palmyra, tamāla, karṇikāra, juniper, walnut, kharjūra, śipan, nīpa, mango, pear, āmalakī, wood apple, pomegranate, elephant apple, plantain, banyan fig, goolar fig, myrobalan, aśvattha, vārśika, nutmeg, dhanuṣkarī, rosewood, magnolia, aśoka, taraṇi, pāṭalā, śiriṣa, and arjun trees.

source: ཕུ་ཆུ་དང་འབབ་ཆུའི་དངོ་དང་། མཚེའུ་དང་། ལྟེང་ཀ་དང་། རྫིང་བུ་དང་། ཁྲོན་པ་དྲི་ཞིམ་པོ་དང་ལྡན་པ་དག་གིས་མཛེས་པར་བྱས་པ། མེ་ཏོག་ཨུཏྤལ་དང་། པད་མ་དང་། ཀུ་མུ་ད་དང་། པད་མ་དཀར་པོ་དག་གིས་གང་བ་
en: The parks were beautified by cascading streams, waterfalls, lakes, pools, ponds, and springs of fragrant water filled with purple, pink, red, and white lotus flowers.

source: ངང་པ་དང་། རྨ་བྱ་དང་། ཁྲུང་ཁྲུང་དང་། ངུར་པ་དང་། ཁུ་བྱུག་དང་། ཆུན་ལག་དང་། ནེ་ཙོ་དང་། རི་སྐེགས་དང་། ཤང་ཤང་ཏེའུ་དང་། ཙ་ཀོ་ར་དང་། འཇོན་མོ་དང་། ཀ་རན་ད་བ་རྣམས་སྐད་འབྱིན་པ།
en: There one could hear the calls of geese, peacocks, cranes, ducks, cuckoos, ospreys, parrots, grouse, pheasants, partridges, nightingales, and wild ducks.

source: བུང་བ་བརྒྱ་སྟོང་དག་གིས་མཛེས་པར་བྱས་པ།
en: Countless honeybees buzzed in the air.

source: ཆུ་ཡན་ལག་བརྒྱད་དང་ལྡན་པ་གསལ་ཞིང་དྲི་ཞིམ་ལ་ཤིན་ཏུ་བསིལ་བ་དང་། རྙོག་པ་མེད་ཅིང་རྣམ་པར་དང་བས་ཡོངས་སུ་གང་བ་
en: The water in the parks possessed eight special qualities and was limpid, flavorful, cool, pristine, and pure.

source: གསིང་མ་སྔོ་ཞིང་འཇམ་ལ་གཞོན་པ། དར་དང་། བལ་དང་། སྲིན་བལ་དང་། མོན་དར་དང་། ཀ་ཙ་ལིན་དི་ཀ་དང་། ཟར་མའི་གོས་ལྟར་རེག་ན་
en: The grass was green, soft and tender, and as pleasing to the touch as silk, wool, cotton, raw silk, kācilindika cloth, and linen.

source: བདེ་བ། ཡིད་དུ་འོང་ཞིང་གཙང་ལ་རྡོ་དང་། གསེག་མ་དང་། གྱོ་མོ་དང་། བཀྲ་མི་ཤིས་པ་དང་། འདམ་རྫབ་དང་། སྙག་སྙིག་མེད་པའི་ས་ཕྱོགས་བཟང་པོ་
en: Those fine parks were beautiful, clean, and free of any stones, pebbles, gravel, dirt, mud, or refuse.

source: རི་དགས་སྣ་ཚོགས་ལྡང་སྐོ་སྐ་དང་། ཤ་བཀྲ་དང་། སྤྲེའུ་དང་། བྱི་ལ་དང་། སྲེ་མོ་དང་། རི་བོང་དང་། དོམ་དང་། དྲེད་དང་། བྱའི་ཚོགས་ཀྱིས་བསྟེན་པ་
en: They were also home to various wild animals, such as śarabha, spotted deer, monkeys, cats, brown bears, rabbits, black bears, hyenas, and a number of different birds.

source: མཚན་མོའི་ལྷ་དང་། ལྷའི་བུ་མོ་དང་། འཇིག་རྟེན་སྐྱོང་དང་། ཆུ་ལྷ་དང་། ཞི་བ་དང་། གཤིན་རྗེ་དང་། འཕགས་སྐྱེས་པོ་དང་། ལུས་ངན་པོ་དང་། བརྒྱ་བྱིན་དང་། མིག་མི་བཟང་དང་། ཡུལ་འཁོར་སྲུང་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། དྲི་ཟ་དང་། མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་འབུམ་དག་གནས་པ་ན་རྟེན་ཅིང་བཞུགས་ཏེ་
en: Hundreds of thousands of other beings were also present, such as gods and goddesses of the night, guardians of the world, Varuṇa, Śiva, Yama, Virūḍhaka, Kubera, Śakra, Virūpākṣa, and Dhṛtarāṣṭra, as well as asuras, garuḍas, gandharvas, kiṃnaras, and mahoragas.

source: དགེ་སློང་གི་དགེ་འདུན་ཆེན་པོ་དགེ་སློང་བདུན་ཁྲི་བདུན་སྟོང་ལ་འདི་ལྟ་སྟེ།
en: A large saṅgha of seventy-seven thousand monks was also residing there, including

source: ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་དང་། ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོ་དང་། ཚེ་དང་ལྡན་པ་རབ་འབྱོར་དང་། ཚེ་དང་ལྡན་པ་ཀ་པི་ན་དང་། ཚེ་དང་ལྡན་པ་བ་ལང་བདག་དང་། ཚེ་དང་ལྡན་པ་གསུས་པོ་ཆེ་དང་། ཚེ་དང་ལྡན་པ་བྷ་ར་དྭ་ཛ་དང་། ཚེ་དང་ལྡན་པ་ཀུན་ཤེས་ཀཽཎྜི་ནྱ་དང་། ཚེ་དང་ལྡན་པ་བཟང་ལྡན་དང་། ཚེ་དང་ལྡན་པ་གང་པོ་དང་། ཚེ་དང་ལྡན་པ་རབ་ཏུ་བཟང་པོ་དང་། ཚེ་དང་ལྡན་པ་ལམ་ཕྲན་བསྟན་དང་། ཚེ་དང་ལྡན་པ་བཀྐུ་ལ་དང་། ཚེ་དང་ལྡན་པ་སྒྲ་གཅན་ཟིན་དང་། ཚེ་དང་ལྡན་པ་ཉེ་དགའ་བོ་དང་། ཚེ་དང་ལྡན་པ་དགའ་བོ་དང་། ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་དང་། དེ་དག་ལ་སོགས་པ་དགེ་སློང་བདུན་ཁྲི་བདུན་སྟོང་ལ་འདི་ལྟ་སྟེ།
en: venerable Śāradvatīputra, venerable Mahāmaudgalyāyana, venerable Subhūti, venerable Kapphiṇa, venerable Gavāṃpati, venerable Mahākauṣṭhila, venerable Bharadvāja, venerable Ājñātakauṇḍinya, venerable Bhadrika, venerable Pūrṇa, venerable Suśubha, venerable Cūḍāpanthaka, venerable Bakkula, venerable Rāhula, venerable Upananda, venerable Nanda, and venerable Ānanda.

source: ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་གང་ཟག་གཅིག་མ་གཏོགས་པར་ཐམས་ཅད་ཀྱང་དགྲ་བཅོམ་པ། ཟག་པ་ཟད་པ། ཉོན་མོངས་པ་མེད་པ།
en: With the exception of one person—namely, venerable Ānanda—they were all worthy ones who had exhausted the defilements and were without afflictions.

source: དབང་དང་ལྡན་པར་གྱུར་པ། སེམས་ཤིན་ཏུ་རྣམ་པར་གྲོལ་བ། ཤེས་རབ་ཤིན་ཏུ་རྣམ་པར་གྲོལ་བ།
en: They were endowed with powers, and had liberated minds and liberated insight.

source: ཅང་ཤེས་པ། གླང་པོ་ཆེན་པོ། བྱ་བ་བྱས་པ། བྱེད་པ་བྱས་པ། ཁུར་བོར་བ། བདག་གི་དོན་རྗེས་སུ་ཐོབ་པ། སྲིད་པར་ཀུན་ཏུ་སྦྱོར་བ་ཡོངས་སུ་ཟད་པ།
en: They were of noble origin and like great elephants. Their work was done, their deeds were done, they had laid down their burden, they had accomplished their own welfare, and their ties to existence were exhausted.

source: ཡང་དག་པའི་ཤེས་པས་སེམས་ཤིན་ཏུ་རྣམ་པར་གྲོལ་བ། སེམས་ཐམས་ཅད་ཀྱི་དབང་དམ་པའི་ཕ་རོལ་ཏུ་སོན་པ་ཤ་སྟག་དང་ཐབས་ཅིག་གོ། །
en: Due to their correct perception, their minds were utterly liberated, and they had perfected the sacred mastery of all mental states.

source: བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་ཆེན་པོ་བྱང་ཆུབ་སེམས་དཔའ་བྱེ་བ་འབུམ་ཕྲག་དུ་མ་ལ་འདི་ལྟ་སྟེ།
en: Also present was a great assembly of trillions of bodhisattvas that included

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱམས་པ་དང་། འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་དང་། སྤྱན་རས་གཟིགས་དབང་ཕྱུག་དང་། མཐུ་ཆེན་ཐོབ་དང་། ཀུན་ཏུ་བཟང་པོ་དང་། ནམ་མཁའི་སྙིང་པོ་དང་། ལྷའི་ཅོད་པན་དང་། རིན་ཆེན་ཅོད་པན་དང་། ལག་ན་རིན་ཆེན་དང་། རིན་ཆེན་འོད་དང་། རིན་ཆེན་སྙིང་པོ་དང་། རིན་ཆེན་གཙུག་ཕུད་དང་། རིན་ཆེན་སེང་གེ་དང་། རིན་ཆེན་དྲ་བ་ཅན་དང་། དྲ་བ་ཅན་གྱི་འོད་དང་། ཉི་འོད་དང་། ཟླ་འོད་དང་། མཐུ་བརྟན་དང་། བློ་གྲོས་བརྟན་དང་། བརྩོན་འགྲུས་བརྟན་དང་། མཐུ་རྩལ་བརྟན་དང་། སྤྲོ་བ་བརྟན་དང་། སྤྲོ་བ་ཆེ་བ་དང་། མཆོག་ཏུ་དགའ་བའི་རྒྱལ་པོ་དང་། སྨན་གྱི་རྒྱལ་པོ་དང་། སྨན་ཡང་དག་འཕགས་དང་། དགེ་བ་དྲི་མ་མེད་པ་རྣམ་དག་རིན་ཆེན་ཟླ་འོད་རྒྱལ་པོ་དང་། པད་མའི་འདབ་མ་ལྟར་དྲི་མ་མེད་པ་རྒྱུ་སྐར་རྒྱལ་པོ་མངོན་པར་ཤེས་པའི་མེ་ཏོག་ཤིན་ཏུ་རྒྱས་པ་དང་། བུང་བ་དང་། སྣག་ས་དང་། རྨ་བྱ་དང་། འཇོན་མོ་དང་། མུགས་གསལ་རལ་པའི་ཐོར་ཚུགས་ཅན་དང་། པད་མ་དང་། ཟླ་བ་ལྟར་བཞིན་འཛུམ་ཞིང་བརྗིད་ལ་མདངས་གསལ་བ་དང་། རིན་པོ་ཆེ་མཐོན་ཀ་ལྟར་མིག་ཤིན་ཏུ་མཛེས་པ་ཡོན་ཏན་རིན་པོ་ཆེའི་ཏོག་དང་། སོ་མཉམ་ཞིང་ཐགས་བཟང་ལ་དཀར་བ་དངུལ་དང་། དུང་དང་། ཟླ་བ་དང་། ཀུ་མུ་ད་དང་། འོ་མ་ལྟར་དཀར་བ་དང་། ལྕེ་ཆུ་ཤིང་གི་ལོ་མ་དང་། ཏ་ལའི་འདབ་མ་ལྟར་ཡངས་ཤིང་ཟངས་ཀྱི་གླེགས་མ་ལྟ་བུ་དང་། ཁུ་བྱུག་དང་། ནེ་ཙོ་དང་། རི་སྐེགས་དང་། ཀུ་ན་ལ་དང་། ཀ་ལ་པིང་ཀ་སྐད་འབྱིན་པ་ལྟ་བུར་ཡིད་དུ་འོང་བའི་ང་རོའི་གདངས་ངེས་པར་སྒྲོགས་པ་དང་། ལུས་ཟླ་བ་དང་། ཉི་མ་འཆར་ཀ་དང་། དོང་ཀའི་ཤིང་དང་། ས་ཧ་ཀ་ར་དང་། མེ་ཏོག་འབྱུང་བའི་ཀ་དམ་པ་ལྟ་བུ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྐ་ལག་ཕྲ་ཞིང་མཉེན་ལ་གཞོན་ཤ་ཆགས་ཤིང་སྲབ་ལ་འཇམ་ཞིང་། མེ་ཏོག་ལྟར་ཤིན་ཏུ་གཞོན་ལ་རྐ་ལག་གི་སེན་མོ་ཟངས་ཀྱི་མདོག་འདྲ་བ་དང་།
en: the bodhisattva great beings Maitreya; Mañjuśrīkumārabhūta; Avalokiteśvara; Mahāsthāmaprāpta; Samantabhadra; Ākāśagarbha; Devamukuṭa; Ratnamukuṭa; Ratnapāṇi; Ratnaprabha; Ratnagarbha; Ratnacūḍa; Ratnasiṃha; Ratnajālin; Jālinīprabha; Sūryaprabha; Candraprabha; Stable Strength; Dṛḍhamati; Dṛḍhavīrya; Dṛḍhavikrama; Determined Effort; Mahotsāha; Prāmodyarāja; Bhaiṣajyarāja; Bhaiṣajyasamudgata; King Precious Moonlight of Pure Virtue; Kamala­dala­vimala­nakṣatra­rāja­saṃkusumitā­bhijña; Hair in a Topknot Shining Dark Like Bees, Ink, Peacocks, and Nightingales; Smiling Face That Brightly Shines Like the Moon and a Lotus Flower; Top Ornament of Precious Qualities With Magnificent Sapphire-Like Eyes; Equal and Evenly Set Teeth White Like Silver, Conch Shells, the Moon, a White Lotus, and Milk; Tongue Wide as the Leaves of Palm and Plantain Trees and Resembling a Copper Plate; Voice as Delightful as the Songs of Cuckoos, Parrots, Grouse, Pheasants, and Kalaviṅka Birds; Moonlike Body; Rising Sun; Resembling the Karṇikāra Tree, the Mango Tree, and the Blooming Burflower Tree; and the bodhisattva great being Slender, Supple, Firm, Fine, and Smooth Limbs Youthful Like Flowers and with Copper-Colored Nails.

source: དེ་དག་ལ་སོགས་པ་བྱང་ཆུབ་སེམས་དཔའ་དགུ་ཁྲི་དགུ་སྟོང་ཐམས་ཅད་ཀྱང་ཕྱིར་མི་ལྡོག་པ། ཕྱིར་མི་ལྡོག་པའི་ཆོས་ཀྱི་འཁོར་ལོ་སྐོར་བ།
en: Including these bodhisattvas, there were a total of ninety-nine thousand bodhisattvas, all of whom were irreversible in their progress and turned the wheel of the irreversible Dharma.

source: བདུད་དང་། ཕྱིར་རྒོལ་བ་ངེས་པར་བཅོམ་པ། བདུད་ཀྱི་ལས་ཐམས་ཅད་ལས་ཡང་དག་པར་འདས་པ།
en: They had subjugated demons and opponents and overcome all the activities of Māra.

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཡུལ་ལ་འཇུག་པ་ཤེས་པ་ལ་མཁས་པ།
en: They were experts in the knowledge that engages with the domain of the thus-gone ones.

source: མངོན་པར་ཤེས་པ། དཔའ་བར་འགྲོ་བའི་ཏིང་ངེ་འཛིན་གྱི་མཐའི་སྒོ་བསྒྲུབ་པའི་གཟུངས་ཐོབ་པ། ཕ་རོལ་ཏུ་ཕྱིན་པ་ཐམས་ཅད་ལ་ཐབས་མཁས་པ་རྟོགས་པར་ཁོང་དུ་ཆུད་པ།
en: They had developed the superknowledges, attained the retention that brings about the final gateway of the absorption of bravery, and mastered the skillful means related to all the perfections.

source: འཇིག་རྟེན་གྱི་ཁམས་ཐ་དད་པ་སྟོན་པ། གོ་ཆ་ཆེན་པོ་བགོས་པ། སངས་རྒྱས་ཀྱི་ཡོན་ཏན་ལ་ཐེ་ཙོམ་མེད་པ།
en: They revealed different world systems, had donned the great armor, and had no doubts concerning the qualities of the buddhas.

source: ཉོན་མོངས་པ་དང་ཉེ་བའི་ཉོན་མོངས་པའི་བག་ཆགས་ཐམས་ཅད་ལ་སེམས་པས་བག་ཆགས་དང་མཚམས་སྦྱོར་བ་དང་བཅས་པར་མངོན་པའི་ང་རྒྱལ་ཡང་དག་པར་བཅོམ་ནས
en: By contemplating all the latent tendencies of the primary and secondary afflictions, they had conquered pride and its attendant habitual tendencies and predispositions.

source: དུལ་བ་དང་། དེས་པ་དང་ལྡན་པ།
en: As such, they were disciplined and gentle.

source: དྲན་པ་ཉེ་བར་གཞག་པ་དང་། ཡང་དག་པར་སྤོང་བ་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་དང་། དབང་པོ་དང་། སྟོབས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། ལམ་ལ་ཞུགས་པ་བྱམས་པ་དང་། སྙིང་རྗེ་དང་། དགའ་བ་དང་། བཏང་སྙོམས་དང་། བཟོད་པ་དང་། བསམ་པ་དང་། བག་ལ་ཉལ་ཕུན་སུམ་ཚོགས་པ།
en: They had perfected the applications of mindfulness, the true exertions, the bases of miraculous power, the powers, the strengths, the factors of awakening, and other qualities of the path such as love, compassion, joy, equanimity, patience, and intention, as well as other wholesome propensities.

source: ང་རྒྱལ་དང་། རྒྱགས་པ་དང་། དྲེགས་པ་དང་། ཉེས་རྩོམ་དང་། ཁེངས་པ་དང་། སེར་སྣ་དང་། ངར་འཛིན་པ་དང་། ང་ཡིར་འཛིན་པ་དང་། ལྷག་པར་ཞེན་པ་དང་། ཆགས་པ་དང་། ཞེན་པ་དང་། བརྒྱལ་བ་དང་། སྲེད་པ་དང་། མངོན་པར་ཞེན་པ་དང་བྲལ་བ་
en: They were free of pride, vanity, haughtiness, aggression, arrogance, miserliness, selfishness, possessiveness, fixation, attachment, grasping, oblivion, craving, and longing.

source: བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་གྲངས་མེད་པར་བདག་ལ་ཕན་པ་དང་། གཞན་ལ་ཕན་པ་དང་། བདེ་བར་སྦྱོར་བ་ལ་བརྩོན་ལ།
en: For countless eons they had endeavored to benefit and bring happiness to both themselves and others, and

source: དགེ་བའི་རྩ་བ་ཤིན་ཏུ་བསགས་ཤིང་ཚོགས་རྫོགས་པར་བྱས་པའི་རྒྱུད་ཅན་
en: they had thoroughly gathered the roots of virtue and perfected the accumulations.

source: སྒྱུ་དང་། གཡོ་དང་བརྫུན་དང་། ཕྲ་མ་དང་། ངག་རྩུབ་པོ་དང་། གསོད་པ་དང་། གནོད་པར་བྱེད་པ་དང་། འཆིང་བ་དང་། ལྟ་བ་ངན་པས་གཟིངས་པ་དང་། བསྡིགས་པ་དང་། རྩོད་པ་དང་། འཐབ་པ་དང་། འབྲེག་པ་དང་། འཁྲུག་ལོང་དང་། འགྱེད་པ་དང་། ཉེ་བའི་ཉོན་མོངས་པ་དང་བྲལ་བ་ཤ་སྟག་དང་།
en: They were free of hypocrisy, deceit, lies, slander, harsh words, killing, harming, bondage, wrong views, threatening, quarreling, strife, fighting, dispute, dueling, and all related afflictions.

source: འཇིག་རྟེན་སྐྱོང་བ་བཞི་པོ་འདི་ལྟ་སྟེ།
en: Also in attendance were the four guardians of the world:

source: རྒྱལ་པོ་ཆེན་པོ་རྣམ་ཐོས་ཀྱི་བུ་དང་། རྒྱལ་པོ་ཆེན་པོ་ཡུལ་འཁོར་སྲུང་དང་། རྒྱལ་པོ་ཆེན་པོ་འཕགས་སྐྱེས་པོ་དང་། རྒྱལ་པོ་ཆེན་པོ་མིག་མི་བཟང་རང་རང་གི་གཡོག་འཁོར་གྱིས་བསྐོར་བ་རྣམས་དང་།
en: the great king Vaiśravaṇa, the great king Dhṛtarāṣṭra, the great king Virūḍhaka, and the great king Virūpākṣa, each surrounded by his respective attendants.

source: གནོད་སྦྱིན་གྱི་སྡེ་དཔོན་ཆེན་པོ་ལྔས་རྩེན་རང་གི་བུའི་འཁོར་དང་བཅས་པ་དང་། གནོད་སྦྱིན་གྱི་སྡེ་དཔོན་ཆེན་པོ་ལག་ན་རྡོ་རྗེ་རང་གི་གནོད་སྦྱིན་གྱི་འཁོར་དང་བཅས་པ་དང་། འབྱུང་པོ་ཆེན་པོའི་མ་འཕྲོག་མ་རང་གི་གནོད་སྦྱིན་མོའི་འཁོར་དང་བཅས་པ་དང་།
en: There were the yakṣa general Pāñcika accompanied by his sons, the yakṣa general Vajrapāṇi with his retinue of yakṣas, and the great bhūta Hārītī with her retinue of female yakṣas.

source: དུང་ཅན་མ་དང་། མདུང་ཐོགས་མ་དང་། སེར་མོ་དང་། དཀའ་ཟློག་མ་དང་། དཔལ་གྱི་ལྷ་མོ་ཆེན་མོ་དང་། དབྱངས་ཅན་མ་དང་། འཇིགས་བྱེད་མ་དང་། ཟླ་བ་དང་། ལྷའི་དབང་པོ་བརྒྱ་བྱིན་དང་། ལྷའི་བུ་དབང་ཕྱུག་ཆེན་པོ་དང་། མི་མཇེད་ཀྱི་བདག་པོ་ཚངས་པ་རང་གི་ལྷའི་བུའི་འཁོར་དང་བཅས་པ་དག་དང་།
en: Śaṅkhinī, Female Spear Holder, Yellow-Robed, Umā, Mahāśrīdevī, Sarasvatī, Bhairavī, Candra, Śakra, lord of the gods, the god Maheśvara, and Brahmā, lord of the Sahā world, were also in attendance. All were accompanied by their respective divine retinues.

source: ཀླུའི་རྒྱལ་པོ་མ་དྲོས་པ་དང་། ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོ་རང་རང་གི་ཀླུའི་འཁོར་དང་བཅས་པ་དག་དང་།
en: There were also the nāga kings Anavatapta and Sāgara, each with his retinue of nāgas;

source: ནམ་མཁའ་ལྡིང་གི་དབང་པོ་གཟི་ཆེན་དང་། ནམ་མཁའ་ལྡིང་གི་དབང་པོ་ལུས་ཆེན་རང་རང་གི་ནམ་མཁའ་ལྡིང་གི་འཁོར་དང་བཅས་པ་དག་དང་།
en: the garuḍa rulers Mahātejas and Mahākāya, each with his retinue of garuḍas;

source: ལྷ་མ་ཡིན་གྱི་དབང་པོ་སྟོབས་ཅན་དང་། ལྷ་མ་ཡིན་གྱི་དབང་པོ་སྒྲ་གཅན་རང་རང་གི་ཚོགས་ཀྱི་འཁོར་དང་བཅས་པ་དག་དང་།
en: the asura rulers Bali and Rāhu, each with his retinue;

source: མིའམ་ཅིའི་རྒྱལ་པོ་ལྗོན་པ་རང་གི་མིའམ་ཅིའི་འཁོར་དང་བཅས་པ་དང་།
en: the kiṃnara king Druma with his retinue of kiṃnaras;

source: དྲི་ཟའི་བུ་ཟུར་ཕུད་ལྔ་པ་རང་གི་འཁོར་དང་བཅས་པ་དང་།
en: and the gandharva Pañcaśikha with his own retinue.

source: དེ་ལས་གཞན་པ་ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དང་། མི་དང་མི་མ་ཡིན་པ་གཟི་བརྗིད་ཆེ་བ་གཟི་བརྗིད་ཆེ་བ་དཔག་ཏུ་མེད། གྲངས་མེད་པ་དག་དང་ཡང་ཐབས་ཅིག་སྟེ།
en: Countless other majestic gods, nāgas, yakṣas, gandharvas, asuras, garuḍas, kiṃnaras, mahoragas, humans, and non-humans were also present.

source: རིགས་བཞི་པོ་བྲམ་ཟེ་དང་། རྒྱལ་རིགས་དང་། རྗེའུ་རིགས་དང་། དམངས་རིགས་རྣམས་དང་། འཁོར་བཞི་པོ་དགེ་སློང་དང་། དགེ་སློང་མ་དང་། དགེ་བསྙེན་དང་། དགེ་བསྙེན་མ་རྣམས་དང་། ཤཱཀྱ་བྱེ་བ་ཁྲག་ཁྲིག་ཕྲག་འབུམ་དག་དང་། རྒྱལ་པོ་རྣམས་དང་། བློན་པོ་ཆེན་པོ་རྣམས་དང་། གྲོང་རྡལ་གྱི་མི་རྣམས་དང་། ཡུལ་གྱི་མི་རྣམས་དང་། ཁྱིམ་བདག་དང་། བློན་པོ་དང་། ཕོ་བྲང་འཁོར་གྱི་མི་དང་། སྒོ་དཔོན་གྱི་འཁོར་རྣམས་ཀྱིས་བསྐོར་ཅིང་
en: In this way the Blessed One was surrounded by members of the four castes of priests, warriors, merchants, and commoners; the four retinues of monks, nuns, laymen, and laywomen; as well as countless members of the Śakya clan, kings, ministers, townspeople, villagers, householders, officials, members of the royal court, and village elders.

source: མདུན་གྱིས་བལྟས་ནས་བཀུར་སྟི་བྱས། བླ་མར་བྱས། རི་མོ་བྱས།
en: These people all attended to the Blessed One and served, honored, and venerated him.

source: མཆོད་པ་བྱས་ཏེ།
en: They made offerings such that

source: བཅོམ་ལྡན་འདས་ཀྱིས་ན་བཟའ་དང་། ཞལ་ཟས་དང་། གཟིམས་ཆ་དང་། གདན་དང་། སྙུན་གྱི་གསོས་སྨན་དང་། ཡོ་བྱད་མང་པོ་གྱ་ནོམ་པ་དག་བརྙེས་ཤིང་
en: the Blessed One obtained food, beverages, bedding, cushions, and medicine, as well as many other excellent offering articles.

source: ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་རབ་འབྱམ་དཔག་ཏུ་མེད། གྲངས་མེད་པ་དག་ཏུ་ཡང་། བཅོམ་ལྡན་འདས་ཀྱི་གྲགས་པ་དང་། སྒྲ་དང་། ཚིགས་སུ་བཅད་པ་རྒྱ་ཆེར་མངོན་པར་གྲགས་སོ། །
en: In this way the Blessed One’s fame, renown, and praise extended far throughout the immeasurable worlds of the ten directions.

source: རྡོ་རྗེའི་སྙིང་པོའི་ས་ཕྱོགས་མཉམ་ཞིང་ཡིད་དུ་འོང་ལ་རྒྱ་ཆེ་ཞིང་ཡངས་པ།
en: The ground, of the essence of diamond, was even, pleasant, vast, and open.

source: ཆག་ཆག་ལེགས་པར་བཏབ་པ། ཕྱག་དར་ལེགས་པར་བྱས་པ། ལེགས་པར་རྣམ་པར་ཕྱེ་བ། པོག་སྣོད་ནས་བདུགས་པ།
en: It had been sprinkled with water, swept clean, made symmetrical, and made fragrant with smoke rising from incense burners.

source: མེ་ཏོག་ཨུཏ་པ་ལ་དང་། པད་མ་དང་། ཀུ་མུ་ད་དང་། པད་མ་དཀར་པོ་དང་། ཨ་ཏི་མུག་ཏ་ཀ་དང་། ཀ་དམ་པ་དང་། པར་ཤི་ཀ་དང་། ཏ་ར་ནི་དང་། སྐྱ་སྣར་དང་། མྱ་ངན་འཚང་དང་། ཀོ་རན་ད་ཀ་དང་། སྣ་མ་དང་། ཡུ་ཐི་ཀའི་མེ་ཏོག་དག་བཀྲམ་པ།
en: The ground was strewn with purple, pink, red, and white lotus flowers, as well as the flowers of goolar fig, nīpa, vārśika, taraṇi, pāṭalā, aśoka, kuraṇṭaka, nutmeg, and utika trees.

source: རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་ཤིང་ལྗོན་པས་མཛེས་པར་བྱས་པ་ན་
en: The site was also adorned with trees made of various precious gems.

source: སེང་གེའི་ཁྲི་རིན་པོ་ཆེའི་སྙིང་པོ་དང་། རིན་པོ་ཆེའི་རས་བཅོས་བུ་འབུམ་དག་བཏིང་བ།
en: on a lion throne made of precious gemstones, upon which hundreds of thousands of precious fabrics had been spread.

source: རིན་པོ་ཆེའི་བླ་རེ་བྲེས་པ། རིན་པོ་ཆེའི་དྲིལ་བུ་གཡེར་ཀའི་དྲ་བ་བྲེས་པ། རིན་པོ་ཆེའི་ལྡ་ལྡི་སྤྱངས་པ།
en: The throne was sheltered by a precious bejeweled canopy, adorned with a precious web of small jewel bells, and embellished with precious gemstone lattices.

source: རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱིས་སྤྲས་པ། ནོར་བུ་དང་། གསེར་དང་། རྡོ་རྗེ་དང་། བཻ་དཱུརྱ་དང་། མུ་ཏིག་དང་། དུང་དང་། མན་ཤེལ་དང་། བྱི་རུ་དང་། ཨན་ད་རྙིལ་དང་། རྡོའི་སྙིང་པོ་དང་། མ་རྒད་དང་། སྤུག་དང་། ཤེལ་དང་། རིན་པོ་ཆེ་བྱེ་བ་ཁྲག་ཁྲིག་ཕྲག་འབུམ་དག་གིས་བརྒྱན་པ་
en: It was further decorated with myriad precious materials and gemstones, such as gold, diamonds, beryls, pearls, conch shells, moonstones, coral, sapphires, emeralds, cat’s eye, and crystal.

source: ལ་བཞུགས་ཏེ
en: There the Blessed One sat,

source: དབང་པོ་ཞི་བ་ཐུགས་ཞི་བ་དུལ་བ་དང་ཞི་གནས་དམ་པ་བརྙེས་པ། དུལ་བ་དང་ཞི་གནས་མཆོག་བརྙེས་པ། བསྲུངས་པ། གཙོ་བོར་གྱུར་པ། དབང་པོ་ཐུལ་བ།
en: The Blessed One’s senses were peaceful, his mind was at ease, and he had arrived at a sacred state of composure and tranquility. He had attained, sustained, and mastered perfect composure and calm, and he had brought his passions under control.

source: མཚོ་ལྟར་དང་ཞིང་གསལ་ལ་རྙོག་པ་མེད་པ།
en: Like a lake, his mind was pure, clear, and pristine.

source: རིན་པོ་ཆེའི་མཆོད་སྡོང་ལྟར་མངོན་པར་འཕགས་པ་དཔལ་འབར་ཞིང་ལམ་མེ་ལྷན་ནེར་བཞུགས་པ།
en: Like a sacrificial post made of precious substances, he was refined, dazzling, and brilliant.

source: སྐུ་སྐྱེས་བུ་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་ཀྱིས་ལེགས་པར་བརྒྱན་པ། སྐུ་དཔེ་བྱད་བཟང་པོས་མཛེས་པར་བྱས་པ།
en: His body was adorned with the thirty-two major marks of a great being and beautified with the excellent minor marks.

source: རྒྱ་མཚོ་ཆེན་པོ་ལྟར་དམ་པའི་ཆོས་ཀྱི་ཆུས་ཡོངས་སུ་གང་བ།
en: Like the ocean, he was filled with the water of the sacred Dharma.

source: རི་རབ་ལྟར་མི་བསྐྱོད་པ།
en: Like Mount Sumeru, he was unshakable.

source: ས་ལྟར་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཉེ་བར་འཚོ་བ།
en: Like the earth, he sustained all beings.

source: ཆུ་ལྟར་དགེ་བའི་རྩ་བ་རབ་ཏུ་སྐྱེད་པ།
en: Like water, he gave rise to roots of virtue.

source: ཐ་སྙད་ལྟར་ཐུགས་མཉམ་པ།
en: Like the administration of justice, he was unbiased.

source: ནམ་མཁའ་ལྟར་གོས་པ་མེད་པ།
en: Like the sky, he was immaculate.

source: ཉི་མ་ལྟར་མི་ཤེས་པའི་མུན་པ་སེལ་བ།
en: Like the sun, he dispelled the darkness of ignorance.

source: ཟླ་བ་ལྟར་དཀར་པོའི་ཆོས་ཡོངས་སུ་རྫོགས་པ།
en: Like the moon, he had perfected all pure qualities.

source: ཡིད་བཞིན་གྱི་ནོར་བུ་ལྟར་བསམ་པ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་མཛད་པ།
en: Like a wish-fulfilling jewel, he fulfilled all aspirations.

source: ཉི་མ་ལྟར་ཤར་བ།
en: Like the sun, he was lofty.

source: ཟླ་བ་ལྟར་བསིལ་ཞིང་སིམ་པར་མཛད་པ།
en: Like the moon, he was cooling and soothing.

source: རྒྱ་མཚོ་ལྟར་རིན་པོ་ཆེའི་འབྱུང་གནས་སུ་གྱུར་པ་རྒྱ་མཚོ་ལྟར་ཟབ་པ།
en: Like the ocean, he was a source of wealth, and like the ocean, too, he was deep.

source: མེའི་ཕུང་པོ་ལྟར་སྣང་བ།
en: Like a fire, he was shining.

source: ལུས་མི་བསྐྱོད་པ།
en: His body was unshakable;

source: སེམས་མི་གཡོ་བ། ཞི་ཞིང་རབ་ཏུ་ཞི་བ།
en: his mind was unwavering, calm, and serene;

source: དབང་པོ་འཁྲུལ་པ་མི་མངའ་བ། མ་ཁེངས་ཤིང་མི་རྒོད་པ་དང་།
en: and his senses were free of delusion, arrogance, and excitement.

source: དྲན་པ་ལེགས་པར་ཉེ་བར་གཞག་པ། སྤྱོད་ལམ་མཛེས་པ། ལེགས་པར་མཉམ་པར་གཞག་པ། རྟག་ཏུ་མཉམ་པར་གཞག་པ།
en: He observed perfect mindfulness, his conduct was excellent, and he was composed and constantly in equipoise.

source: ཕྱི་མའི་མཐའི་བསྐལ་པ་བྱེ་བ་ཕྲག་འབུམ་དུ་དགེ་བའི་རྩ་བ་ཐམས་ཅད་ཡང་དག་པར་བསྒྲུབས་པ། བསོད་ནམས་ཀྱི་ཚོགས་ཐམས་ཅད་བསགས་པ།
en: Over countless billions of eons he had accomplished all the roots of virtue and gathered the entire accumulation of merit;

source: ཕ་རོལ་ཏུ་ཕྱིན་པ་ཐམས་ཅད་ལ་ཐབས་མཁས་པ། རྟོགས་པར་ཐུགས་སུ་ཆུད་པ། སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའི་ས་ཐམས་ཅད་ལ་རྣམ་པར་རོལ་པ།
en: he had become skilled in all the perfections and he sported on all the levels of the buddhas and bodhisattvas.

source: བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཐམས་ཅད་ཐུགས་ཀྱིས་སྤྱད་པ། སེམས་ཅན་ཐམས་ཅད་ཀྱིས་ཕན་པ་དང་བདེ་བ་འཐོབ་པར་བྱ་བའི་ཕྱིར་བརྩོན་པ་དེ་ཆོས་སྟོན་ཏེ།
en: He enthusiastically engaged in all the activities of the bodhisattvas, strived for the benefit and happiness of all beings, and taught the Dharma.

source: ཚངས་པར་སྤྱོད་པ། ཐོག་མར་དགེ་བ། བར་དུ་དགེ་བ། ཐ་མར་དགེ་བ།
en: The Dharma he taught presents pure conduct. It is virtuous in the beginning, virtuous in the middle, and virtuous in the end.

source: དོན་བཟང་པོ། ཚིག་འབྲུ་བཟང་པོ། མ་འདྲེས་པ། ཡོངས་སུ་རྫོགས་པ། ཡོངས་སུ་དག་པ། ཡོངས་སུ་བྱང་བ། དྲི་མ་མེད་པ། འོད་གསལ་བ། ཡིད་དུ་འོང་བ། ཡིད་དུ་འཐད་པ། ཡིད་སིམ་པར་བྱེད་པ། ཡིད་ཤིན་ཏུ་དགའ་བར་བྱེད་པ། ཡིད་སྐུལ་བར་བྱེད་པ། ཡིད་མགུ་ཞིང་རྒྱས་པར་བྱེད་པ།
en: This Dharma, with its excellent meanings and excellent words, is unadulterated, complete, pure, refined, stainless, luminous, pleasant, agreeable, fulfilling, elating, inspiring, delightful, and mentally enriching.

source: རྣམ་པར་དག་པ། འཇིགས་པ་མེད་པ། མི་རྩུབ་པ། བརྟན་པ། ཟབ་པ། མི་གཡོ་བ། མི་འགྱུར་བ། བརྟག་ཏུ་མེད་པ། རྟོག་གེ་བའི་སྤྱོད་ཡུལ་མ་ཡིན་པ། བསམ་གྱིས་མི་ཁྱབ་པ། རྨད་དུ་བྱུང་བ། བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པ།
en: It is pristine, fearless, gentle, stable, profound, immutable, unchanging, indisputable, beyond the reach of the intellect, inconceivable, marvelous, and utterly inexpressible.

source: སྟོན་ཅིང་འཆད་དེ་རྣམ་པར་འབྱེད་ལ་འགྲེལ་ཅིང་གསལ་བར་མཛད་དོ། །
en: Such is the Dharma that he taught, presented, explained, and elucidated.

source: དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རིའི་ཕུག་དང་། ཟོམ་དང་། རི་སུལ་དང་། གསེབ་དང་། སྨན་ལྗོངས་ན་སེང་གེའི་མཆོག་རྣམ་པར་བསྒྱིངས་ཤིང་ང་རོ་རྣམ་པར་སྒྲོགས་པ་ལྟ་བུའི་མིའི་དབང་པོའི་གཙུག་གི་ནོར་བུ་ཞེས་བྱ་བ།
en: at that time was the bodhisattva great being called Crown Jewel of the Lord of Men Resembling a Sublime Lion Sporting and Roaring in Mountain Caves, Peaks, Clefts, Valleys, and Meadows.

source: གཟུགས་བཟང་བ། མཛེས་པ། བལྟ་ན་སྡུག་པ། ཁ་དོག་བཟང་པོ། རྒྱས་པ་མཆོག་དང་ལྡན་པ་
en: He had a beautiful physique and was handsome and pleasant to behold. His complexion was attractive. He was well developed and replete with the most delightful features.

source: སྔོན་གྱི་རྒྱལ་བ་རྣམས་ལ་ལྷག་པར་བྱ་བ་བྱས་པ། དགེ་བའི་རྩ་བ་བསྐྱེད་པ། སངས་རྒྱས་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་མང་པོ་ལ་བསྙེན་བཀུར་བྱས་པ། དཀོན་མཆོག་གསུམ་གྱི་གདུང་འཚོབ་པ།
en: He had served victorious ones of the past, created roots of virtue with them, and honored myriad buddhas, and now he upheld the lineage of the Three Jewels.

source: སྙིང་རྗེ་ཅན། སྤོབས་པ་ཐོགས་པ་མེད་པ།
en: He was compassionate, and his eloquence was unimpeded.

source: སྐྱེ་དགུ་ལ་མཉེས་གཤིན་པ། དད་པ་བཟང་བ། བསམ་པ་དགེ་བ། བརྟན་པ། ཟབ་པ།
en: He was loving toward all beings, of pure faith, and his attitude was virtuous, steadfast, and profound.
